Transcribed from a blog post
<https://www.reddit.com/r/ethereum/comments/169nztd/an_ethereum_library_in_common_lisp/>

No rights reserved.

* Installation
With an ANSI Common Lisp implementation configured with Quicklisp
#+caption: Initial Installation
#+begin_src lisp :results raw
  (ql:quickload "eth-cl")
  (asdf:load-system :eth-cl)
#+end_src

* Usage

#+caption: Load ETH-CL
#+begin_src lisp
  (asdf:load-system :eth-cl)
#+end_src

#+caption: Test ETH-CL
#+begin_src lisp
  (asdf:test-system :eth-cl)
#+end_src

#+caption: Create a new Ethereum account
#+begin_src lisp 
  (eth:make-account)
#+end_src

#+caption: Create a new Ethereum account with keys under <file:~/etc/>
#+begin_src lisp 
  (eth::generate-ethereum-keypair/codex)
#+end_src

#+RESULTS:
: ((:PRIVATE-KEY . #<IRONCLAD:SECP256K1-PRIVATE-KEY {7C1BAB60}>)
:  (:PUBLIC-KEY . #<IRONCLAD:SECP256K1-PUBLIC-KEY {72DC4A93}>)
:  (:ADDRESS . "CA75d46C356DE23AB8f7C965045f4579f86A4Dc4"))

#+begin_src lisp
  (eth::compute-address (alexandria:assoc-value (eth:make-account) :private-key))
#+end_src

#+RESULTS:
: 32B201a80275DeE36698Af62F9d3Fd60e99d21E8

* Colophon  
  #+begin_example
    Created: 2024-09-20
    Revised: <2024-09-25 Wed 09:33>
  #+end_example
